Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: If desired you can now also set the threshold speed and slow run current.
it_it: Volendo, ora si può anche impostare la velocità di soglia e la corrente di funzionamento lento.

source: If enabled, the measurement frequency will be reduced to one measurement per four fullsteps.
it_it: Se abilitato, la frequenza di misurazione verrà ridotta a una misurazione ogni quattro passi completi.

source: If it can not be downloaded normally, you can use other sources to download:
it_it: Se non è possibile scaricarlo normalmente, è possibile utilizzare altre fonti per scaricarlo:

source: If it is the first time to flash the program for a new project, you will need to select the download method, and select UART
it_it: Se è la prima volta che si esegue il flashing del programma per un nuovo progetto, è necessario selezionare il metodo di download e selezionare UART.

source: If more than one file is open the currently selected file will be assembled.
it_it: Se sono aperti più file, verrà assemblato il file attualmente selezionato.

source: If mounting is successful, return ESP_OK, indicating that the TYF card initialization is complete.
it_it: Se il montaggio ha esito positivo, restituisce ESP_OK, a indicare che l'inizializzazione della scheda TYF è completa.

source: If needed the connected evaluation boards can be set manually by picking them from the lists in the Manual Board Assignment section.
it_it: Se necessario, le evaluation board collegate possono essere impostate manualmente selezionandole dagli elenchi nella sezione Manual Board Assignment.

source: If no EDS file can be found for a device then only the Expert Mode tool can be used.
it_it: Se non è possibile trovare un file EDS per un dispositivo, è possibile utilizzare solo il tool Expert Mode.

source: If online installation fails due to network factor, use Install Offline.
it_it: Se l'installazione online non riesce a causa di problemi di rete, utilizzare Installazione Offline.

source: If online installation fails, use Install Offline.
it_it: Se l'installazione online non riesce, utilizzare l'Installazione offline.

source: If only one module is connected you can normally leave both values at 1, as this is also the factory default setting on TRINAMIC modules.
it_it: Se è collegato un solo modulo, è possibile lasciare entrambi i valori a 1, poiché questa è anche l'impostazione predefinita di fabbrica sui moduli TRINAMIC.

source: If only one module is connected you can normally leave both values at 1, as this is also the factory default setting on Trinamic modules.
it_it: Se è collegato un solo modulo, normalmente è possibile lasciare entrambi i valori a 1, poiché questa è anche l'impostazione predefinita di fabbrica sui moduli Trinamic.

source: If selected the TMCL history window and/or the advanced tooltip window will also be shown.
it_it: Se selezionata, verranno visualizzate anche la finestra della cronologia TMCL e/o la finestra dei tooltip avanzati.

source: If the ESP32 version number is 3.0.6 or above, the ESP32-S3-Touch-LCD-4.3 supports direct model selection.
it_it: Se il numero di versione dell'ESP32 è 3.0.6 o superiore, l'ESP32-S3-Touch-LCD-4.3 supporta il modello diretto selezione.

source: If the ESP32S3 mainboard only has a USB port, you need to enable USB CDC, as shown in the following diagram:
it_it: Se la scheda madre ESP32S3 ha solo una porta USB, è necessario abilitare USB CDC, come mostrato nel diagramma seguente:

source: If the PDO definitions have been changed on the device, click the Reload Definitions button.
it_it: Se le definizioni PDO sono state modificate sul dispositivo, cliccare sul pulsante Reload Definitions.

source: If the difference between the current time and the last time a message was sent is greater than or equal to the set transmission time interval TRANSMIT_RATE_MS , then update the last send time to the current time and call the send_message function to send a message.
it_it: Se la differenza tra l'ora corrente e l'ultima volta che un messaggio è stato inviato è maggiore o uguale all'intervallo di tempo di trasmissione impostato TRANSMIT_RATE_MS, aggiorna l'ora dell'ultimo invio all'ora corrente e chiama la funzione send_message per inviare un messaggio.

source: If the driver is not installed, it will return to the failed state after waiting for a period of time
it_it: Se il driver non è installato, tornerà allo stato di errore dopo un certo periodo di tempo.

source: If the error code is not 2 (indicating that the device is not responding), the error code and the corresponding address are printed.
it_it: Se il codice di errore non è 2 (indicando che il dispositivo non risponde), vengono visualizzati il ​​codice di errore e l'indirizzo corrispondente.

source: If the error code is 0, an I2C device was found at that address, print the device address and increase the count of the number of devices.
it_it: Se il codice di errore è 0, è stato trovato un dispositivo I2C a quell'indirizzo, ne visualizza l'indirizzo e incrementa il conteggio dei dispositivi.

source: If the file is a valid firmware file then its size, check sum and version will be shown.
it_it: Se il file è un file firmware valido, ne verranno mostrate le dimensioni, il checksum e la versione.

source: If the following characters show, the connection is successful:
it_it: Se vengono visualizzati i seguenti caratteri, la connessione è riuscita:

source: If the following error occurs, click on the serial monitor and use the debugging tool to resend the data.
it_it: Se si verifica il seguente errore, cliccare sul monitor seriale e utilizzare lo strumento di debug per inviare nuovamente i dati.

source: If the message is received successfully, it will be printed to the serial port
it_it: Se il messaggio viene ricevuto correttamente, verrà stampato sulla porta seriale.

source: If the module is equipped with an USB interface then this is mostly the easiest way for updating the firmware.
it_it: Se il modulo è dotato di un'interfaccia USB, questo è solitamente il modo più semplice per aggiornare il firmware.

source: If the mount fails, an error message will be output and returned.
it_it: Se il montaggio fallisce, verrà visualizzato un messaggio di errore.

source: If the mount is successful, the type of TF card will be detected and output, and information about the size of the TF card will also be output.
it_it: Se il montaggio ha esito positivo, verrà rilevato e visualizzato il tipo di scheda TF, insieme alle informazioni sulla sua dimensione.

source: If the port cannot be recognized, please enter boot mode (press and hold the boot button, then connect to the computer, and then release the boot button).
it_it: Se la porta non viene riconosciuta, accedere alla modalità di boot (tenere premuto il pulsante di boot, quindi connettersi al computer e rilasciare il pulsante di boot).

source: If the queuing is successful, it prints a success message; otherwise, it prints a failure message.
it_it: Se l'inserimento in coda ha esito positivo, stampa un messaggio di successo; in caso contrario, stampa un messaggio di errore.

source: If the register address is 16 bits, send the low byte first (according to the requirements of the slave device, some devices need to send the high byte first), such as reading the 10 bytes of the 0x0004 address (the input length position needs to be filled in the number of bytes to be read):
it_it: Se l'indirizzo del registro è a 16 bit, inviare prima il byte basso (in base ai requisiti del dispositivo slave, alcuni dispositivi devono inviare prima il byte alto), ad esempio leggendo i 10 byte dell'indirizzo 0x0004 (la posizione della lunghezza di input deve essere inserita nel numero di byte da leggere):

source: If the return value is aarch64, it means it is 64-bit ARM architecture (for Raspberry Pi).
it_it: Se il valore restituito è aarch64, significa che si tratta di un'architettura ARM a 64 bit (per Raspberry Pi).

source: If the return value is armv61 or armv71, it means it is 32-bit ARM architecture (for Raspberry Pi).
it_it: Se il valore restituito è armv61 o armv71, significa che si tratta di un'architettura ARM a 32 bit (per Raspberry Pi).

source: If the return value is x86_64, it is not Raspberry Pi.
it_it: Se il valore restituito è x86_64, non si tratta di Raspberry Pi.

source: If there is a reset button on the development board, press the reset button; if there is no reset button, please power it on again
it_it: Se sulla scheda di sviluppo è presente un pulsante di reset, premerlo; in caso contrario, riaccendere la scheda.

source: If there is already a ".so" file in the folder that is intended for use on aarch64 architecture, replace it with the ".so" file that is compatible with your current system.
it_it: Se nella cartella è già presente un file ".so" destinato all'uso con l'architettura aarch64, sostituirlo con il file ".so" compatibile con il sistema corrente.

source: If there is an esp32 folder in this path, it is recommended to save it and delete the original esp32 folder in this path, so that you can use the newly generated esp32 folder in the offline package normally
it_it: Se è presente una cartella esp32 in questo path, si consiglia di salvarla ed eliminare la cartella esp32 originale in questo percorso, in modo da poter utilizzare normalmente la cartella esp32 appena generata nel pacchetto offline

source: If there's no screen response after programming the code, check whether the correct configurations are set in Arduino IDE -> Tools, select the corresponding Flash (16MB) and enable PSRAM (8MB OPI))
it_it: Se non si verifica alcuna risposta sullo schermo dopo aver programmato il codice, verificare che le configurazioni corrette siano impostate in Arduino IDE -> Tools, selezionare la Flash corrispondente (16 MB) e abilitare PSRAM (8 MB OPI).

source: If this file has already been loaded into the editor then it will be taken from there.
it_it: Se il file è già stato caricato nell'editor, verrà caricato da lì.

source: If this happens, set this value higher than zero.
it_it: In tal caso, impostare questo valore su un valore maggiore di zero.

source: If this is selected the entry will be displayed in italic letters.
it_it: Selezionando questa opzione, la voce verrà visualizzata in corsivo.

source: If this option is not selected, all objects contained by the DCF file will be downloaded in numerical order.
it_it: Se questa opzione non è selezionata, tutti gli oggetti contenuti nel file DCF verranno scaricati in ordine numerico.

source: If you are just getting started with ESP32 and Arduino, and you don't know how to create, compile, flash, and run Arduino ESP32 programs, then please expand and take a look.
it_it: Se si è appena iniziato a usare ESP32 e Arduino e non si sa come creare, compilare, flashare ed eseguire programmi Arduino ESP32, preghiamo di approfondire e dare un'occhiata.

source: If you are just getting started with ESP32 and ESP-IDF, and you don't know how to create, compile, flash, and run ESP-IDF ESP32 programs, then please expand and take a look.
it_it: Se si è appena iniziato a usare ESP32 ed ESP-IDF e non si sa come creare, compilare, flashare ed eseguire programmi ESP-IDF ESP32, espandere e dare un'occhiata.

source: If you are not sure about the ID setting of a module you can also enter from 1 to 127 so that the TMCL-IDE will automatically scan through all possible CANopen node IDs, but this will take some time.
it_it: Se non si è sicuri dell'impostazione dell'ID di un modulo, è anche possibile inserire un valore compreso tra 1 e 127 in modo che TMCL-IDE esegua automaticamente la scansione di tutti i possibili ID nodo CANopen, ma questa operazione richiederà del tempo.

source: If you are not sure about the ID setting of a module you can also enter from 1 to 2047 so that the TMCL-IDE will automatically scan through all possible CAN module IDs, but this will take some time.
it_it: Se non si è sicuri dell'impostazione dell'ID di un modulo, è anche possibile immettere un numero compreso tra 1 e 2047, in modo che TMCL-IDE esegua automaticamente la scansione di tutti i possibili ID dei moduli CAN, ma questa operazione richiederà del tempo.

source: If you are not sure about the ID setting of a module you can also enter from 1 to 255 so that the TMCL-IDE will automatically scan through all possible serial module IDs, but this will take some time.
it_it: Se non si è sicuri dell'impostazione dell'ID di un modulo, è possibile immettere un numero compreso tra 1 e 255 in modo che TMCL-IDE esegua automaticamente la scansione di tutti i possibili ID dei moduli seriali, ma questa operazione richiederà del tempo.

source: If you do not wish the pulse divisor and/or the ramp divisor to get changed automatically check the Lock checkbox beside the pulse divisor and/or the ramp divisor.
it_it: Se non si desidera che il divisore di impulsi e/o il divisore di rampa vengano modificati automaticamente, selezionare la checkbox Lock accanto al divisore di impulsi e/o al divisore di rampa.

source: If you need technical support or have any feedback/review, please click the Submit Now button to submit a ticket, Our support team will check and reply to you within 1 to 2 working days.
it_it: Se c'è bisogno di supporto tecnico o si hanno feedback/recensioni, cliccare sul pulsante Invia Ora per inviare un ticket. Il nostro team di supporto verificherà la situazione e risponderà entro 1 o 2 giorni lavorativi.

source: If you use other projects, the operation steps can be applied similarly.
it_it: Se si utilizzano altri progetti, le fasi operative possono essere applicate in modo simile.

source: If you want to further increase the frame rate, you can refer to this link for configuration.
it_it: Per aumentare ulteriormente il frame rate, è possibile fare riferimento a questo link per la configurazione.

source: If you want to use I2C or SPI to transmit the data by UART, you can switch to mode 1 or mode 2.
it_it: Per utilizzare I2C o SPI per trasmettere i dati tramite UART, è possibile passare alla modalità 1 o alla modalità 2.

source: If you want to use the UART to send and receive data when using I2C or SPI, switch the mode to mode 1 or mode 2 (mode 1 for ch34x_pis* and tty* devices, mode 2 for hidraw* devices).
it_it: Per utilizzare l'UART per inviare e ricevere dati quando si utilizza I2C o SPI, impostare la modalità su 1 o 2 (modalità 1 per i dispositivi ch34x_pis* e tty*, modalità 2 per i dispositivi hidraw*).

source: If you want to use the serial port debugging assistant to send and receive UART when using I2C or SPI, please switch the mode to Mode 1 (Mode 2 is HID driverless mode and will not be displayed in the port).
it_it: Per utilizzare l'assistente di debug della porta seriale per inviare e ricevere UART quando si utilizza I2C o SPI, impostare la Modalità 1 (la Modalità 2 è quella HID senza driver e non verrà visualizzata la porta).

source: If you want to use two UART ports, you can switch to Mode0 and then connect to the PC.
it_it: Per utilizzare due porte UART, si deve passare alla Mode0 e poi connettere al PC.

source: If you wish not to save that object value in the DCF file at all, uncheck the Component of DCF file checkbox.
it_it: Se non si desidera salvare affatto il valore di quell'oggetto nel file DCF, deselezionare la checkbox Component of DCF file.

source: If you wish to restart the program from the very beginning, select the Stop/Reset function before clicking Run/Continue.
it_it: Per riavviare il programma dall'inizio, selezionare la funzione Stop/Reset prima di cliccare Run/Continue.

source: If EXAMPLE_ENABLE_PRINT_LCD_FPS is defined, the callback function ending with VSync is attached to the LCD object.
it_it: Se EXAMPLE_ENABLE_PRINT_LCD_FPS è definito, la funzione di callback che termina con VSync viene associata all'oggetto LCD.

source: Import from INI and store to NVM: This does the same as Import from INI, but additionally stores the axis parameters in the EEPROM (NVM, non-volatile memory) of the module.
it_it: Import from INI and store to NVM: Questa funzione fa la stessa cosa di Import from INI, ma memorizza anche i parametri degli assi nella EEPROM (NVM, memoria non volatile) del modulo.

source: Import from INI: Use this function to download all axis parameters that have previously been saved using the Export to INI function.
it_it: Import from INI: Utilizzare questa funzione per scaricare tutti i parametri degli assi precedentemente salvati utilizzando la funzione Export to INI.

source: In ESP_Panel_Board_Custom.h there is a macro definition for selecting whether to turn on the touch function, with a value of 0 corresponds to turning off touch, and a value of 1 corresponds to turning on touch, which can be selected according to the model purchased
it_it: In ESP_Panel_Board_Custom.h è presente una definizione macro per selezionare se attivare o meno la funzione touch: il valore 0 corrisponde alla disattivazione del touch, mentre il valore 1 corrisponde all'attivazione del touch, e può essere selezionato in base al modello acquistato.

source: In Mode 0, the product provides 2x high-speed UART channels.
it_it: In Modalità 0, il prodotto fornisce 2 canali UART ad alta velocità.

source: In Mode 1 or Mode 2, the product provides 1x high-speed UART channel, 1x I2C interface (SCL and SDA lines), and 1 4-wire SPI interface (CS line, SCK line, SDI/MISO line, SDO/MOSI line).
it_it: In Modalità 1 o Modalità 2, il prodotto fornisce 1 canale UART ad alta velocità, 1 interfaccia I2C (linee SCL e SDA) e 1 interfaccia SPI a 4 fili (linea CS, linea SCK, linea SDI/MISO, linea SDO/MOSI).

source: In Mode 2, it operates as an HID plug-and-play device (Human Interface Device) and does not require drivers.
it_it: In Modalità 2, funziona come un dispositivo HID plug-and-play (Human Interface Device) e non richiede driver.

source: In Mode 3, the product provides a JTAG interface, supporting either a 4-wire or 5-wire interface (TMS, TCK, TDI, TDO, and TRST lines).
it_it: In Modalità 3, il prodotto fornisce un'interfaccia JTAG, che supporta un'interfaccia a 4 o 5 fili (linee TMS, TCK, TDI, TDO e TRST).

source: In all auto tuning modes, the P and I parameters are set to 0 initially and then are increased to determine an optimal set of parameters.
it_it: In tutte le modalità di regolazione automatica, i parametri P e I vengono inizialmente impostati a 0 e poi aumentati per determinare un set di parametri ottimale.

source: In an infinite loop, data is read from the UART, the read data is written back to the UART, and log information is recorded when data is received.
it_it: In un ciclo infinito, i dati vengono letti dall'UART, i dati letti vengono riscritti sull'UART e le informazioni di log vengono registrate al momento della ricezione.

source: In an infinite loop, there is also a 1-second delay in the print loop after the current ADC value is read.
it_it: In un ciclo infinito, c'è anche un ritardo di 1 secondo nel ciclo di stampa dopo la lettura del valore corrente dell'ADC.

source: In case of a download failure, please press the Reset button for more than 1 second or enter download mode, and wait for the PC to recognize the device again before downloading once more
it_it: In caso di errore del download, premere il pulsante Reset per più di 1 secondo o entrare in modalità download e attendere che il PC riconosca nuovamente il dispositivo prima di eseguire un altro download.

source: In contrast to the Device Configuration tool, it always saves the values of all writable objects in the DCF file that it generates.
it_it: A differenza del tool Device Configuration, salva sempre i valori di tutti gli oggetti scrivibili nel file DCF che genera.

source: In fact, an SAP command respective an SGP command will be generated internally for the module.
it_it: Infatti, un comando SAP o un comando SGP verranno generati internamente per il modulo.

source: In manual continuous flux step responses are applied.
it_it: Nella regolazione manuale a flusso continuo vengono applicate risposte al gradino.

source: In many cases the factory default values do not need to be changed much.
it_it: In molti casi, i valori di default di fabbrica non richiedono modifiche sostanziali.

source: In most cases it is expedient to enable the filter before using CoolStep.
it_it: Nella maggior parte dei casi è opportuno abilitare il filtro prima di utilizzare CoolStep.

source: In most cases, this option should be switched on, so normally leave this checked.
it_it: Nella maggior parte dei casi, questa opzione dovrebbe essere attivata, quindi normalmente è consigliabile lasciarla selezionata.

source: In order to be able to see and also to modify the binary representation of a TMCL command, click the More button.
it_it: Per poter visualizzare e modificare la rappresentazione binaria di un comando TMCL, cliccare sul pulsante More.

source: In order to be able to work properly with a CANopen device, the TMCL-IDE needs to have some knowledge of its CANopen object dictionary and its other capabilities.
it_it: Per poter lavorare correttamente con un dispositivo CANopen, TMCL-IDE deve avere una certa conoscenza del suo dizionario oggetti CANopen e delle sue altre funzionalità.

source: In order to make effective use of the StallGuard feature one should choose a velocity where the load value is as low as possible and where the color is green.
it_it: Per utilizzare efficacemente la funzione StallGuard, è necessario scegliere una velocità in cui il valore del carico sia il più basso possibile e il colore sia verde.

source: In other cases, the double quotes can be left out, but we recommend to use them.
it_it: In altri casi, le virgolette doppie possono essere omesse, ma si consiglia di utilizzarle.

source: In particular, this also applies to the stated possible applications or areas of applications of the product.
it_it: In particolare, ciò si applica anche alle possibili applicazioni o aree di applicazione del prodotto indicate.

source: In some areas, if you are unable to download normally due to network factors, you can try to switch to the mobile network or click Configure proxy in the preferences menu, or select Install Offline.
it_it: In alcune aree, se non si riesce a scaricare normalmente a causa di problemi di rete, è possibile provare a passare alla rete mobile o cliccare su "Configure proxy" nel menu delle preferenze, oppure selezionare Install Offline.

source: In some cases, numbers can be entered as decimal numbers or as hexadecimal numbers.
it_it: In alcuni casi, i numeri possono essere inseriti come numeri decimali o come numeri esadecimali.

source: In such a case the Channel entry will be shown.
it_it: In tal caso, verrà visualizzata la voce Channel.

source: In such cases, visible strings can be entered as text, and octet strings can be entered as hexadecimal bytes (two digits without preceding “0x”) separated by spaces.
it_it: In questi casi, le stringhe visibili possono essere inserite come testo e le stringhe di ottetti come byte esadecimali (due cifre senza “0x” precedente) separati da spazi.

source: In the Network section, network wide LSS functions are provided.
it_it: Nella sezione Network, sono disponibili funzioni LSS per l'intera rete.

source: In the Object section on the left hand side of the window, the object index and sub-index can be entered.
it_it: Nella sezione Object sul lato sinistro della finestra, è possibile inserire l'indice e il sottoindice dell'oggetto.

source: In the Parameters section the acceleration, deceleration, and target velocity can be set.
it_it: Nella sezione Parameters è possibile impostare accelerazione, decelerazione e velocità target.
